In [1]:
!pip install pandas

Requirement already satisfied: pandas in e:\anaconda\lib\site-packages (1.5.3)
Requirement already satisfied: numpy>=1.21.0 in e:\anaconda\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in e:\anaconda\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: python-dateutil>=2.8.1 in e:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in e:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('psa.csv')
print(df)

   Roll no. student name  grade  marks
0    190503   khiza hayat     A   72.0
1    190457         usama     c   64.0
2    190451      ehtisham   NaN    NaN
3    190433           ali   NaN   53.0
4    190441          raza     b   66.0

In [4]:
df.head()

   Roll no. student name  grade  marks
0    190503   khiza hayat     A   72.0
1    190457         usama     c   64.0
2    190451      ehtisham   NaN    NaN
3    190433           ali   NaN   53.0
4    190441          raza     b   66.0

In [5]:
df.shape

(5, 4)

In [6]:
df.isnull()

   Roll no.  student name   grade  marks
0     False          False  False  False
1     False          False  False  False
2     False          False   True   True
3     False          False   True  False
4     False          False  False  False

In [7]:
df.isnull().sum()

Roll no.         0
student name     0
grade            2
marks            1
dtype: int64

In [8]:
df.isnull().sum().sum()

3

# filling the null values

In [9]:
df2=df.fillna(value=0)
df2

   Roll no. student name  grade  marks
0    190503   khiza hayat     A   72.0
1    190457         usama     c   64.0
2    190451      ehtisham     0    0.0
3    190433           ali     0   53.0
4    190441          raza     b   66.0

# filling the null values with a previous value

In [10]:
df4=df.fillna(method='pad')
df4

   Roll no. student name  grade  marks
0    190503   khiza hayat     A   72.0
1    190457         usama     c   64.0
2    190451      ehtisham     c   64.0
3    190433           ali     c   53.0
4    190441          raza     b   66.0

In [11]:
df4.isnull().sum()

Roll no.         0
student name     0
grade            0
marks            0
dtype: int64

In [12]:
# filling the null value with coming value to next row value

In [13]:
df5=df.fillna(method='bfill')
df5

   Roll no. student name  grade  marks
0    190503   khiza hayat     A   72.0
1    190457         usama     c   64.0
2    190451      ehtisham     b   53.0
3    190433           ali     b   53.0
4    190441          raza     b   66.0

In [14]:
# filling the null value with coming value to next coloumn  value

In [15]:
df6=df.fillna(method='pad',axis=1)
df6

  Roll no. student name      grade     marks
0   190503   khiza hayat         A      72.0
1   190457         usama         c      64.0
2   190451      ehtisham  ehtisham  ehtisham
3   190433           ali       ali      53.0
4   190441          raza         b      66.0

In [16]:
df7=df.fillna(method='bfill',axis=1)
df7

  Roll no. student name  grade marks
0   190503   khiza hayat     A  72.0
1   190457         usama     c  64.0
2   190451      ehtisham   NaN   NaN
3   190433           ali  53.0  53.0
4   190441          raza     b  66.0

In [18]:
#filling diffferent null values in diffret couloumns

In [20]:
df8=df.fillna({'grade':'abcd',
              'marks':'defg'})
df8

   Roll no. student name  grade marks
0    190503   khiza hayat     A  72.0
1    190457         usama     c  64.0
2    190451      ehtisham  abcd  defg
3    190433           ali  abcd  53.0
4    190441          raza     b  66.0

In [21]:
# filling the value with the mean of a coloumn
df9=df.fillna(value=df['marks'].mean())
df9

   Roll no. student name   grade  marks
0    190503   khiza hayat      A  72.00
1    190457         usama      c  64.00
2    190451      ehtisham  63.75  63.75
3    190433           ali  63.75  53.00
4    190441          raza      b  66.00